import networkx as nx
import matplotlib.pyplot as plt

#桁上げ先行加算器を定義する変数
#遷移と状態を定義している

#状態はワイヤーに対応した1bitを複数桁用意した状態変数で記述される
#粒子がある場合1,ない場合0となる
#例えば0~4のワイヤーのうちワイヤー0と2にある状態は、0b00101、で表される

#遷移は1の場所を移す論理演算で記述される
#例えば0と2のトークンを4と5に移すとき、XOR0b11101を作用させる
#生成消滅演算子を作用させていると考えられる

#論理変数はA,B,C(comming carry),X(result),G(going carry)

#全てのワイヤーは次のようになる
#入力
#A,notA,B,notB,C,notC
#一段目出力
#A and B,A xor B,not A and not B
#A vor B,not(A xor B)
#二段目出力
#G,not G,C',notC'
#三段目出力
#X,notX,C'',not C''
#全てで19bitの変数になる
#0bG,notG,X,notX,C^2,not C^2 (6状態)
#A xor B,not(A xor B),,C^1,notC^1 (4状態)
#A and B,A xor B,not A and not B (3状態)
#A,notA,B,notB,C,notC (6状態)
#GとCが先頭と最後尾にきていて桁上げが自然に実装されている
#二桁目以降はCを除いた17bitを<<(17N+2) (N=1,2...)して結合すればよい
# S_N << 17N-15 | S_(N-1) << 13N-32 | ... | S_2 << 17+2 | S_1

Mod_length = 19     #モジュール全体の状態数
Base_length = 17    #桁上がり/桁上げを除いた状態数
Cjoin_num = 14      #C-joinゲートの数

#0bG,notG,X,notX,C^2,not C^2,C^1,not C^1,A vor B,not(A xor B),A and B,A xor B,not A and not B,A,notA,B,notB,C,notC
logic_state = {0b1:"not C",
               0b1<<1:"C",
               0b1<<2:"not B",
               0b1<<3:"B",
               0b1<<4:"not A",
               0b1<<5:"A",#入力
               0b1<<6:"not A and not B",
               0b1<<7:"A xor B-G",
               0b1<<8:"A and B",#G方向の一段目出力
               0b1<<9:"not(A xor B)",
               0b1<<10:"A xor B-X",#X方向の一段目出力
               0b1<<11:"not C^1",
               0b1<<12:"C^1",#桁上がりの移動1
               0b1<<13:"not C^2",
               0b1<<14:"C^2",#桁上がりの移動2
               0b1<<15:"not X",
               0b1<<16:"X",#結果の出力
               0b1<<17:"not G",
               0b1<<18:"G"#二段目の桁上げ出力
               }

logic_state_adder ={0b1:"not C",
                    0b1<<1:"C",
                    0b1<<2:"not B",
                    0b1<<3:"B",
                    0b1<<4:"not A",
                    0b1<<5:"A",#入力
                    0b1<<15:"not X",
                    0b1<<16:"X",#結果の出力
                    0b1<<17:"not G",
                    0b1<<18:"G"#二段目の桁上げ出力
                    }

#例えば初期状態は次のうちのどれか
initial =  [0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b010101,
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b011001,
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b100101,
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b101001]

#2桁目以降は17bitで表される
secondary =[0b0000 << 13 | 0b00 << 11 | 0b00 << 9 | 0b00 << 7 | 0b000 <<4 | 0b0101,
            0b0000 << 13 | 0b00 << 11 | 0b00 << 9 | 0b00 << 7 | 0b000 <<4 | 0b0110,
            0b0000 << 13 | 0b00 << 11 | 0b00 << 9 | 0b00 << 7 | 0b000 <<4 | 0b1001,
            0b0000 << 13 | 0b00 << 11 | 0b00 << 9 | 0b00 << 7 | 0b000 <<4 | 0b1010]

#終状態かどうか調べるにはX,notXのビットに結果が入っているか見ればよい
#次のビット列を状態とANDで作用させればよい
final =[0b0001 << 13 | 0b00 << 11 | 0b00 << 9 | 0b00 << 7 | 0b000 <<4 | 0b000000,
        0b0010 << 13 | 0b00 << 11 | 0b00 << 9 | 0b00 << 7 | 0b000 <<4 | 0b000000]

#遷移はC-joinゲートの数だけある。今回は14個
#C-joinゲートによる遷移は次のビット列のXORで表現される
transition =   [0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b01 << 9 | 0b001 <<6 | 0b010100,#一段目
                0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b10 << 9 | 0b010 <<6 | 0b011000,#一段目
                0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b10 << 9 | 0b010 <<6 | 0b100100,#一段目
                0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b01 << 9 | 0b100 <<6 | 0b101000,#一段目
                0b0100 << 15 | 0b00 << 13 | 0b01 << 11 | 0b00 << 9 | 0b001 <<6 | 0b000001,#二段目
                0b0100 << 15 | 0b00 << 13 | 0b10 << 11 | 0b00 << 9 | 0b001 <<6 | 0b000010,#二段目
                0b0100 << 15 | 0b00 << 13 | 0b01 << 11 | 0b00 << 9 | 0b010 <<6 | 0b000001,#二段目
                0b1000 << 15 | 0b00 << 13 | 0b10 << 11 | 0b00 << 9 | 0b010 <<6 | 0b000010,#二段目
                0b1000 << 15 | 0b00 << 13 | 0b01 << 11 | 0b00 << 9 | 0b100 <<6 | 0b000001,#二段目
                0b1000 << 15 | 0b00 << 13 | 0b10 << 11 | 0b00 << 9 | 0b100 <<6 | 0b000010,#二段目
                0b0001 << 15 | 0b01 << 13 | 0b01 << 11 | 0b01 << 9 | 0b000 <<6 | 0b000000,#三段目
                0b0010 << 15 | 0b10 << 13 | 0b10 << 11 | 0b01 << 9 | 0b000 <<6 | 0b000000,#三段目
                0b0010 << 15 | 0b01 << 13 | 0b01 << 11 | 0b10 << 9 | 0b000 <<6 | 0b000000,#三段目
                0b0001 << 15 | 0b10 << 13 | 0b10 << 11 | 0b10 << 9 | 0b000 <<6 | 0b000000]#三段目

#遷移が起こる状態を探索するための配列、配列内のオフセット数が同じものが対応する
#状態ビットとのANDで0にならないものの遷移が起こる
#本来は必要ないが前進確率と交代確率で遷移レートが違うと必要になる

forward =  [0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b010100,#一段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b011000,#一段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b100100,#一段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b101000,#一段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b001 <<6 | 0b000001,#二段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b001 <<6 | 0b000010,#二段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b010 <<6 | 0b000001,#二段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b010 <<6 | 0b000010,#二段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b100 <<6 | 0b000001,#二段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b00 << 9 | 0b100 <<6 | 0b000010,#二段目
            0b0000 << 15 | 0b00 << 13 | 0b01 << 11 | 0b01 << 9 | 0b000 <<6 | 0b000000,#三段目
            0b0000 << 15 | 0b00 << 13 | 0b10 << 11 | 0b01 << 9 | 0b000 <<6 | 0b000000,#三段目
            0b0000 << 15 | 0b00 << 13 | 0b01 << 11 | 0b10 << 9 | 0b000 <<6 | 0b000000,#三段目
            0b0000 << 15 | 0b00 << 13 | 0b10 << 11 | 0b10 << 9 | 0b000 <<6 | 0b000000]#三段目

backward = [0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b01 << 9 | 0b001 <<6 | 0b000000,#一段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b10 << 9 | 0b010 <<6 | 0b000000,#一段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b10 << 9 | 0b010 <<6 | 0b000000,#一段目
            0b0000 << 15 | 0b00 << 13 | 0b00 << 11 | 0b01 << 9 | 0b100 <<6 | 0b000000,#一段目
            0b0100 << 15 | 0b00 << 13 | 0b01 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#二段目
            0b0100 << 15 | 0b00 << 13 | 0b10 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#二段目
            0b0100 << 15 | 0b00 << 13 | 0b01 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#二段目
            0b1000 << 15 | 0b00 << 13 | 0b10 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#二段目
            0b1000 << 15 | 0b00 << 13 | 0b01 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#二段目
            0b1000 << 15 | 0b00 << 13 | 0b10 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#二段目
            0b0001 << 15 | 0b01 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#三段目
            0b0010 << 15 | 0b10 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#三段目
            0b0010 << 15 | 0b01 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000,#三段目
            0b0001 << 15 | 0b10 << 13 | 0b00 << 11 | 0b00 << 9 | 0b000 <<6 | 0b000000]#三段目

#二桁目以降の遷移は遷移ビットの18bitを<<(16N) (N=1,2...)すればよい

node_pos = {"not C":(4,0),
            "C":(4,1),
            "not B":(0,3),
            "B":(0,4),
            "not A":(0,5),
            "A":(0,6),#入力
            transition[0]:(2,3),
            transition[1]:(2,4),
            transition[2]:(2,5),
            transition[3]:(2,6),
            "not A and not B":(4,2),
            "A xor B-G":(4,3),
            "A and B":(4,4),#G方向の一段目出力
            "not(A xor B)":(4,5),
            "A xor B-X":(4,6),#X方向の一段目出力
            transition[4]:(6,-1),
            transition[5]:(6,0),
            transition[6]:(6,1),
            transition[7]:(6,2),
            transition[8]:(6,3),
            transition[9]:(6,4),
            "not C^1":(8,1),
            "C^1":(8,2),#桁上がりの移動1
            "not C^2":(12,5),
            "C^2":(12,6),#桁上がりの移動2
            transition[10]:(10,5),
            transition[11]:(10,6),
            transition[12]:(10,7),
            transition[13]:(10,8),
            "not X":(12,7),
            "X":(12,8),#結果の出力
            "not G":(8,3),
            "G":(8,4)#二段目の桁上げ出力
            }

def initial_test():
    print("one digit")
    for i in range(4):
        print("\ninitial state;"+str(bin(initial[i])))
        for j in range(Cjoin_num):
            if forward[j]&initial[i] == forward[j]:
                print("is transferred by "+str(bin(transition[j])))
                print("to next state;"+(bin(initial[i]^transition[j])))
    print("\ntwo digit")
    for i in range(4):
        for j in range(4):
            state = secondary[j] << 18 | initial[i]
            print("\ninitial state;"+str(bin(state)))
            for k in range(Cjoin_num):
                if forward[k]&state == forward[k]:
                    print("is transferred by 1st module gate;"+str(bin(transition[j])))
                    print("to next state;"+(bin(state^transition[j])))
            for t in range(Cjoin_num):
                if (forward[t]<<16)&state == forward[t]<<16:
                    print("is transferred by 2nd module gate;"+str(bin(transition[j])))
                    print("to next state;"+(bin(state^(transition[j]<<16))))

if __name__ == "__main__":
    G = nx.Graph()
    for i in range(len(logic_state)):
        G.add_node(logic_state[0b1<<i])
    for edge in transition:
        G.add_node(edge)
        for i in range(Mod_length):
            if edge & 0b1<<i:
                G.add_edge(edge,logic_state[0b1<<i])
    nx.draw(G,node_pos,with_labels=True,node_color='skyblue', edge_color='b',node_size=300)
    nx.draw_networkx_nodes(G,node_pos,nodelist=["A","B","C"],node_color='red',node_size=400)
    plt.show()